<a href="https://colab.research.google.com/github/skourta/Machine-Learning-Examples/blob/master/Predicting%20Income%20with%20Random%20Forests.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
from sklearn.model_selection import train_test_split
from sklearn import tree
from sklearn.ensemble import RandomForestClassifier

In [2]:
# there are spaces after the commas
income_data = pd.read_csv('income.csv',header=0,delimiter = ", ")
income_data.head()

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  """Entry point for launching an IPython kernel.

   age         workclass  fnlwgt  ... hours-per-week  native-country income
0   39         State-gov   77516  ...             40   United-States  <=50K
1   50  Self-emp-not-inc   83311  ...             13   United-States  <=50K
2   38           Private  215646  ...             40   United-States  <=50K
3   53           Private  234721  ...             40   United-States  <=50K
4   28           Private  338409  ...             40            Cuba  <=50K

[5 rows x 15 columns]

In [3]:
# we use double brackets to get a dataframe in return 
labels = income_data[['income']]
labels

     income
0     <=50K
1     <=50K
2     <=50K
3     <=50K
4     <=50K
...     ...
2608  <=50K
2609  <=50K
2610  <=50K
2611  <=50K
2612  <=50K

[2613 rows x 1 columns]

In [4]:
# these are the features will be using to construct our random forest
data = income_data[["age", "capital-gain", "capital-loss", "hours-per-week","sex"]]
data.head()

   age  capital-gain  capital-loss  hours-per-week     sex
0   39          2174             0              40    Male
1   50             0             0              13    Male
2   38             0             0              40    Male
3   53             0             0              40    Male
4   28             0             0              40  Female

In [5]:
data['sex'] = data['sex'].apply(lambda row: 0 if row == "Male" else 1)
data.head()

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

   age  capital-gain  capital-loss  hours-per-week  sex
0   39          2174             0              40    0
1   50             0             0              13    0
2   38             0             0              40    0
3   53             0             0              40    0
4   28             0             0              40    1

In [6]:
#Splitting the data into training and test data
trainData, testData, trainLabels, testLabels = train_test_split(data,labels,random_state = 1)
trainData.head()

      age  capital-gain  capital-loss  hours-per-week  sex
1534   50             0             0              40    1
1442   36             0             0              50    0
1732   26             0             0              40    0
1297   41             0             0              40    0
748    29             0             0              40    0

In [7]:
#create the classifier using sckit-learn
classifier = RandomForestClassifier(random_state=1)
classifier.fit(trainData,trainLabels)
#test accuracy
classifier.score(testData, testLabels)

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:2: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().

0.8058103975535168

In [8]:
#adding native-country column by focusing on th US
data = income_data[["age", "capital-gain", "capital-loss", "hours-per-week","sex",'native-country']]
data.head()

   age  capital-gain  capital-loss  hours-per-week     sex native-country
0   39          2174             0              40    Male  United-States
1   50             0             0              13    Male  United-States
2   38             0             0              40    Male  United-States
3   53             0             0              40    Male  United-States
4   28             0             0              40  Female           Cuba

In [9]:
data['sex'] = data['sex'].apply(lambda row: 0 if row == "Male" else 1)
data['native-country'] = data['native-country'].apply(lambda row: 0 if row == "United-States" else 1)
data.head()

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.
/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

   age  capital-gain  capital-loss  hours-per-week  sex  native-country
0   39          2174             0              40    0               0
1   50             0             0              13    0               0
2   38             0             0              40    0               0
3   53             0             0              40    0               0
4   28             0             0              40    1               1

In [10]:
#Splitting the data into training and test data
trainData, testData, trainLabels, testLabels = train_test_split(data,labels,random_state = 1)
trainData.head()

      age  capital-gain  capital-loss  hours-per-week  sex  native-country
1534   50             0             0              40    1               0
1442   36             0             0              50    0               0
1732   26             0             0              40    0               0
1297   41             0             0              40    0               0
748    29             0             0              40    0               1

In [11]:
#create the classifier using sckit-learn
classifier = RandomForestClassifier(random_state=1)
classifier.fit(trainData,trainLabels)
#test accuracy
classifier.score(testData, testLabels)

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:2: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().

0.7844036697247706

###By adding the native-country column we lost some accuracy because that feature didn't really contribute much
We can print the contribution of the features to the accuracy using the feature_importances_ property of the classifier

In [12]:
classifier.feature_importances_

array([0.4341414 , 0.20057176, 0.07718144, 0.22249035, 0.04789565,
       0.01771939])